; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-3-28-26)
(:domain gripper-strips)
(:objects robot1 robot2 robot3 - robot
rgripper1 lgripper1 rgripper2 lgripper2 rgripper3 lgripper3 - gripper
room1 room2 room3 room4 room5 room6 room7 room8 room9 room10 room11 room12 room13 room14 room15 room16 room17 room18 room19 room20 room21 room22 room23 room24 room25 room26 room27 room28 - room
ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 - object)
(:init
(at-robby robot1 room20)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at-robby robot2 room11)
(free robot2 rgripper2)
(free robot2 lgripper2)
(at-robby robot3 room18)
(free robot3 rgripper3)
(free robot3 lgripper3)
(at ball1 room4)
(at ball2 room5)
(at ball3 room4)
(at ball4 room11)
(at ball5 room12)
(at ball6 room20)
(at ball7 room17)
(at ball8 room20)
(at ball9 room21)
(at ball10 room18)
(at ball11 room10)
(at ball12 room19)
(at ball13 room10)
(at ball14 room13)
(at ball15 room24)
(at ball16 room15)
(at ball17 room2)
(at ball18 room23)
(at ball19 room18)
(at ball20 room16)
(at ball21 room1)
(at ball22 room5)
(at ball23 room23)
(at ball24 room8)
(at ball25 room3)
(at ball26 room10)
)
(:goal
(and
(at ball1 room11)
(at ball2 room10)
(at ball3 room2)
(at ball4 room21)
(at ball5 room28)
(at ball6 room5)
(at ball7 room26)
(at ball8 room4)
(at ball9 room16)
(at ball10 room9)
(at ball11 room23)
(at ball12 room4)
(at ball13 room28)
(at ball14 room16)
(at ball15 room21)
(at ball16 room10)
(at ball17 room6)
(at ball18 room3)
(at ball19 room23)
(at ball20 room2)
(at ball21 room18)
(at ball22 room24)
(at ball23 room24)
(at ball24 room7)
(at ball25 room12)
(at ball26 room24)
)
)
)

; plan
1. (pick robot3 ball19 room18 lgripper3)
   deleted: (at ball19 room18) (free robot3 lgripper3)
   added: (carry robot3 ball19 lgripper3)
   goals met: 0 of 26
2. (pick robot3 ball10 room18 rgripper3)
   deleted: (at ball10 room18) (free robot3 rgripper3)
   added: (carry robot3 ball10 rgripper3)
   goals met: 0 of 26
3. (pick robot2 ball4 room11 lgripper2)
   deleted: (at ball4 room11) (free robot2 lgripper2)
   added: (carry robot2 ball4 lgripper2)
   goals met: 0 of 26
4. (pick robot1 ball8 room20 lgripper1)
   deleted: (at ball8 room20) (free robot1 lgripper1)
   added: (carry robot1 ball8 lgripper1)
   goals met: 0 of 26
5. (pick robot1 ball6 room20 rgripper1)
   deleted: (at ball6 room20) (free robot1 rgripper1)
   added: (carry robot1 ball6 rgripper1)
   goals met: 0 of 26
6. (move robot3 room18 room9)
   deleted: (at-robby robot3 room18)
   added: (at-robby robot3 room9)
   goals met: 0 of 26
7. (move robot1 room20 room5)
   deleted: (at-robby robot1 room20)
   added: (at-robby robot1 room5)
   goals met: 0 of 26
8. (move robot2 room11 room8)
   deleted: (at-robby robot2 room11)
   added: (at-robby robot2 room8)
   goals met: 0 of 26
9. (drop robot3 ball10 room9 rgripper3)
   deleted: (carry robot3 ball10 rgripper3)
   added: (at ball10 room9) (free robot3 rgripper3)
   goals met: 1 of 26
10. (drop robot1 ball6 room5 rgripper1)
   deleted: (carry robot1 ball6 rgripper1)
   added: (at ball6 room5) (free robot1 rgripper1)
   goals met: 2 of 26
11. (pick robot2 ball24 room8 rgripper2)
   deleted: (at ball24 room8) (free robot2 rgripper2)
   added: (carry robot2 ball24 rgripper2)
   goals met: 2 of 26
12. (move robot2 room8 room7)
   deleted: (at-robby robot2 room8)
   added: (at-robby robot2 room7)
   goals met: 2 of 26
13. (move robot3 room9 room23)
   deleted: (at-robby robot3 room9)
   added: (at-robby robot3 room23)
   goals met: 2 of 26
14. (move robot1 room5 room4)
   deleted: (at-robby robot1 room5)
   added: (at-robby robot1 room4)
   goals met: 2 of 26
15. (drop robot2 ball24 room7 rgripper2)
   deleted: (carry robot2 ball24 rgripper2)
   added: (at ball24 room7) (free robot2 rgripper2)
   goals met: 3 of 26
16. (drop robot3 ball19 room23 lgripper3)
   deleted: (carry robot3 ball19 lgripper3)
   added: (at ball19 room23) (free robot3 lgripper3)
   goals met: 4 of 26
17. (pick robot1 ball1 room4 rgripper1)
   deleted: (at ball1 room4) (free robot1 rgripper1)
   added: (carry robot1 ball1 rgripper1)
   goals met: 4 of 26
18. (pick robot3 ball23 room23 rgripper3)
   deleted: (at ball23 room23) (free robot3 rgripper3)
   added: (carry robot3 ball23 rgripper3)
   goals met: 4 of 26
19. (drop robot1 ball8 room4 lgripper1)
   deleted: (carry robot1 ball8 lgripper1)
   added: (at ball8 room4) (free robot1 lgripper1)
   goals met: 5 of 26
20. (move robot2 room7 room21)
   deleted: (at-robby robot2 room7)
   added: (at-robby robot2 room21)
   goals met: 5 of 26
21. (move robot3 room23 room24)
   deleted: (at-robby robot3 room23)
   added: (at-robby robot3 room24)
   goals met: 5 of 26
22. (move robot1 room4 room6)
   deleted: (at-robby robot1 room4)
   added: (at-robby robot1 room6)
   goals met: 5 of 26
23. (drop robot2 ball4 room21 lgripper2)
   deleted: (carry robot2 ball4 lgripper2)
   added: (at ball4 room21) (free robot2 lgripper2)
   goals met: 6 of 26
24. (drop robot3 ball23 room24 rgripper3)
   deleted: (carry robot3 ball23 rgripper3)
   added: (at ball23 room24) (free robot3 rgripper3)
   goals met: 7 of 26
25. (pick robot2 ball9 room21 rgripper2)
   deleted: (at ball9 room21) (free robot2 rgripper2)
   added: (carry robot2 ball9 rgripper2)
   goals met: 7 of 26
26. (pick robot3 ball15 room24 lgripper3)
   deleted: (at ball15 room24) (free robot3 lgripper3)
   added: (carry robot3 ball15 lgripper3)
   goals met: 7 of 26
27. (move robot1 room6 room5)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room5)
   goals met: 7 of 26
28. (move robot3 room24 room21)
   deleted: (at-robby robot3 room24)
   added: (at-robby robot3 room21)
   goals met: 7 of 26
29. (move robot2 room21 room16)
   deleted: (at-robby robot2 room21)
   added: (at-robby robot2 room16)
   goals met: 7 of 26
30. (pick robot1 ball22 room5 lgripper1)
   deleted: (at ball22 room5) (free robot1 lgripper1)
   added: (carry robot1 ball22 lgripper1)
   goals met: 7 of 26
31. (drop robot3 ball15 room21 lgripper3)
   deleted: (carry robot3 ball15 lgripper3)
   added: (at ball15 room21) (free robot3 lgripper3)
   goals met: 8 of 26
32. (drop robot2 ball9 room16 rgripper2)
   deleted: (carry robot2 ball9 rgripper2)
   added: (at ball9 room16) (free robot2 rgripper2)
   goals met: 9 of 26
33. (move robot1 room5 room24)
   deleted: (at-robby robot1 room5)
   added: (at-robby robot1 room24)
   goals met: 9 of 26
34. (pick robot2 ball20 room16 lgripper2)
   deleted: (at ball20 room16) (free robot2 lgripper2)
   added: (carry robot2 ball20 lgripper2)
   goals met: 9 of 26
35. (drop robot1 ball22 room24 lgripper1)
   deleted: (carry robot1 ball22 lgripper1)
   added: (at ball22 room24) (free robot1 lgripper1)
   goals met: 10 of 26
36. (move robot2 room16 room15)
   deleted: (at-robby robot2 room16)
   added: (at-robby robot2 room15)
   goals met: 10 of 26
37. (move robot3 room21 room17)
   deleted: (at-robby robot3 room21)
   added: (at-robby robot3 room17)
   goals met: 10 of 26
38. (move robot1 room24 room11)
   deleted: (at-robby robot1 room24)
   added: (at-robby robot1 room11)
   goals met: 10 of 26
39. (pick robot3 ball7 room17 lgripper3)
   deleted: (at ball7 room17) (free robot3 lgripper3)
   added: (carry robot3 ball7 lgripper3)
   goals met: 10 of 26
40. (pick robot2 ball16 room15 rgripper2)
   deleted: (at ball16 room15) (free robot2 rgripper2)
   added: (carry robot2 ball16 rgripper2)
   goals met: 10 of 26
41. (drop robot1 ball1 room11 rgripper1)
   deleted: (carry robot1 ball1 rgripper1)
   added: (at ball1 room11) (free robot1 rgripper1)
   goals met: 11 of 26
42. (move robot3 room17 room26)
   deleted: (at-robby robot3 room17)
   added: (at-robby robot3 room26)
   goals met: 11 of 26
43. (move robot2 room15 room24)
   deleted: (at-robby robot2 room15)
   added: (at-robby robot2 room24)
   goals met: 11 of 26
44. (drop robot3 ball7 room26 lgripper3)
   deleted: (carry robot3 ball7 lgripper3)
   added: (at ball7 room26) (free robot3 lgripper3)
   goals met: 12 of 26
45. (move robot1 room11 room6)
   deleted: (at-robby robot1 room11)
   added: (at-robby robot1 room6)
   goals met: 12 of 26
46. (move robot2 room24 room23)
   deleted: (at-robby robot2 room24)
   added: (at-robby robot2 room23)
   goals met: 12 of 26
47. (move robot3 room26 room13)
   deleted: (at-robby robot3 room26)
   added: (at-robby robot3 room13)
   goals met: 12 of 26
48. (move robot2 room23 room2)
   deleted: (at-robby robot2 room23)
   added: (at-robby robot2 room2)
   goals met: 12 of 26
49. (move robot1 room6 room5)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room5)
   goals met: 12 of 26
50. (pick robot3 ball14 room13 lgripper3)
   deleted: (at ball14 room13) (free robot3 lgripper3)
   added: (carry robot3 ball14 lgripper3)
   goals met: 12 of 26
51. (pick robot1 ball2 room5 lgripper1)
   deleted: (at ball2 room5) (free robot1 lgripper1)
   added: (carry robot1 ball2 lgripper1)
   goals met: 12 of 26
52. (drop robot2 ball20 room2 lgripper2)
   deleted: (carry robot2 ball20 lgripper2)
   added: (at ball20 room2) (free robot2 lgripper2)
   goals met: 13 of 26
53. (move robot3 room13 room16)
   deleted: (at-robby robot3 room13)
   added: (at-robby robot3 room16)
   goals met: 13 of 26
54. (move robot1 room5 room10)
   deleted: (at-robby robot1 room5)
   added: (at-robby robot1 room10)
   goals met: 13 of 26
55. (move robot2 room2 room10)
   deleted: (at-robby robot2 room2)
   added: (at-robby robot2 room10)
   goals met: 13 of 26
56. (drop robot3 ball14 room16 lgripper3)
   deleted: (carry robot3 ball14 lgripper3)
   added: (at ball14 room16) (free robot3 lgripper3)
   goals met: 14 of 26
57. (drop robot1 ball2 room10 lgripper1)
   deleted: (carry robot1 ball2 lgripper1)
   added: (at ball2 room10) (free robot1 lgripper1)
   goals met: 15 of 26
58. (drop robot2 ball16 room10 rgripper2)
   deleted: (carry robot2 ball16 rgripper2)
   added: (at ball16 room10) (free robot2 rgripper2)
   goals met: 16 of 26
59. (pick robot1 ball26 room10 rgripper1)
   deleted: (at ball26 room10) (free robot1 rgripper1)
   added: (carry robot1 ball26 rgripper1)
   goals met: 16 of 26
60. (pick robot2 ball13 room10 lgripper2)
   deleted: (at ball13 room10) (free robot2 lgripper2)
   added: (carry robot2 ball13 lgripper2)
   goals met: 16 of 26
61. (move robot1 room10 room6)
   deleted: (at-robby robot1 room10)
   added: (at-robby robot1 room6)
   goals met: 16 of 26
62. (pick robot2 ball11 room10 rgripper2)
   deleted: (at ball11 room10) (free robot2 rgripper2)
   added: (carry robot2 ball11 rgripper2)
   goals met: 16 of 26
63. (move robot3 room16 room1)
   deleted: (at-robby robot3 room16)
   added: (at-robby robot3 room1)
   goals met: 16 of 26
64. (pick robot3 ball21 room1 lgripper3)
   deleted: (at ball21 room1) (free robot3 lgripper3)
   added: (carry robot3 ball21 lgripper3)
   goals met: 16 of 26
65. (move robot2 room10 room23)
   deleted: (at-robby robot2 room10)
   added: (at-robby robot2 room23)
   goals met: 16 of 26
66. (move robot1 room6 room24)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room24)
   goals met: 16 of 26
67. (drop robot1 ball26 room24 rgripper1)
   deleted: (carry robot1 ball26 rgripper1)
   added: (at ball26 room24) (free robot1 rgripper1)
   goals met: 17 of 26
68. (move robot3 room1 room18)
   deleted: (at-robby robot3 room1)
   added: (at-robby robot3 room18)
   goals met: 17 of 26
69. (drop robot2 ball11 room23 rgripper2)
   deleted: (carry robot2 ball11 rgripper2)
   added: (at ball11 room23) (free robot2 rgripper2)
   goals met: 18 of 26
70. (drop robot3 ball21 room18 lgripper3)
   deleted: (carry robot3 ball21 lgripper3)
   added: (at ball21 room18) (free robot3 lgripper3)
   goals met: 19 of 26
71. (pick robot2 ball18 room23 rgripper2)
   deleted: (at ball18 room23) (free robot2 rgripper2)
   added: (carry robot2 ball18 rgripper2)
   goals met: 19 of 26
72. (move robot1 room24 room6)
   deleted: (at-robby robot1 room24)
   added: (at-robby robot1 room6)
   goals met: 19 of 26
73. (move robot2 room23 room3)
   deleted: (at-robby robot2 room23)
   added: (at-robby robot2 room3)
   goals met: 19 of 26
74. (move robot3 room18 room6)
   deleted: (at-robby robot3 room18)
   added: (at-robby robot3 room6)
   goals met: 19 of 26
75. (move robot1 room6 room4)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room4)
   goals met: 19 of 26
76. (drop robot2 ball18 room3 rgripper2)
   deleted: (carry robot2 ball18 rgripper2)
   added: (at ball18 room3) (free robot2 rgripper2)
   goals met: 20 of 26
77. (pick robot1 ball3 room4 lgripper1)
   deleted: (at ball3 room4) (free robot1 lgripper1)
   added: (carry robot1 ball3 lgripper1)
   goals met: 20 of 26
78. (move robot3 room6 room4)
   deleted: (at-robby robot3 room6)
   added: (at-robby robot3 room4)
   goals met: 20 of 26
79. (move robot2 room3 room28)
   deleted: (at-robby robot2 room3)
   added: (at-robby robot2 room28)
   goals met: 20 of 26
80. (move robot1 room4 room2)
   deleted: (at-robby robot1 room4)
   added: (at-robby robot1 room2)
   goals met: 20 of 26
81. (move robot3 room4 room3)
   deleted: (at-robby robot3 room4)
   added: (at-robby robot3 room3)
   goals met: 20 of 26
82. (drop robot2 ball13 room28 lgripper2)
   deleted: (carry robot2 ball13 lgripper2)
   added: (at ball13 room28) (free robot2 lgripper2)
   goals met: 21 of 26
83. (drop robot1 ball3 room2 lgripper1)
   deleted: (carry robot1 ball3 lgripper1)
   added: (at ball3 room2) (free robot1 lgripper1)
   goals met: 22 of 26
84. (pick robot1 ball17 room2 rgripper1)
   deleted: (at ball17 room2) (free robot1 rgripper1)
   added: (carry robot1 ball17 rgripper1)
   goals met: 22 of 26
85. (pick robot3 ball25 room3 lgripper3)
   deleted: (at ball25 room3) (free robot3 lgripper3)
   added: (carry robot3 ball25 lgripper3)
   goals met: 22 of 26
86. (move robot1 room2 room6)
   deleted: (at-robby robot1 room2)
   added: (at-robby robot1 room6)
   goals met: 22 of 26
87. (move robot3 room3 room12)
   deleted: (at-robby robot3 room3)
   added: (at-robby robot3 room12)
   goals met: 22 of 26
88. (move robot2 room28 room19)
   deleted: (at-robby robot2 room28)
   added: (at-robby robot2 room19)
   goals met: 22 of 26
89. (drop robot1 ball17 room6 rgripper1)
   deleted: (carry robot1 ball17 rgripper1)
   added: (at ball17 room6) (free robot1 rgripper1)
   goals met: 23 of 26
90. (drop robot3 ball25 room12 lgripper3)
   deleted: (carry robot3 ball25 lgripper3)
   added: (at ball25 room12) (free robot3 lgripper3)
   goals met: 24 of 26
91. (pick robot3 ball5 room12 rgripper3)
   deleted: (at ball5 room12) (free robot3 rgripper3)
   added: (carry robot3 ball5 rgripper3)
   goals met: 24 of 26
92. (pick robot2 ball12 room19 lgripper2)
   deleted: (at ball12 room19) (free robot2 lgripper2)
   added: (carry robot2 ball12 lgripper2)
   goals met: 24 of 26
93. (move robot2 room19 room4)
   deleted: (at-robby robot2 room19)
   added: (at-robby robot2 room4)
   goals met: 24 of 26
94. (move robot3 room12 room28)
   deleted: (at-robby robot3 room12)
   added: (at-robby robot3 room28)
   goals met: 24 of 26
95. (drop robot2 ball12 room4 lgripper2)
   deleted: (carry robot2 ball12 lgripper2)
   added: (at ball12 room4) (free robot2 lgripper2)
   goals met: 25 of 26
96. (drop robot3 ball5 room28 rgripper3)
   deleted: (carry robot3 ball5 rgripper3)
   added: (at ball5 room28) (free robot3 rgripper3)
   goals met: 26 of 26
